app/views/courses/index.html.erb

SELECT "students".* FROM "students" WHERE "students"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
      <%# preload student and plan data %>
      <% student               = Student.find(session[:student_id]) %>