app/controllers/courses_controller.rb

  def index
    @term = params[:term] # get the term from URL params
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def enroll
    course = Course.find(params[:id])
    current_student = Student.find(session[:student_id]) # Ensure user is logged in

    # Check if the student is already enrolled
    if current_student.courses.include?(course)
      flash[:notice] = "You're already enrolled in this course!"
      redirect_to courses_path(term: course.term) and return
    end

    # Check if the course has a prerequisite
    if course.prerequisite.present?
      # Get all completed courses for the student
      completed_courses = current_student.user_schedules.where(status: "Planned").pluck(:course_id)

      # Ensure the prerequisite course is completed
      prerequisite_course = Course.find_by(class_name: course.prerequisite)
      if prerequisite_course && !completed_courses.include?(prerequisite_course.id)
        flash[:alert] = "You cannot enroll in #{course.class_name} because you have not completed the prerequisite: #{course.prerequisite}."
        redirect_to courses_path(term: course.term) and return
      end
    end

    # Enroll the student by creating a new UserSchedule entry
    UserSchedule.create!(
      student_id: current_student.id,
      course_id: course.id,
      term: course.term,
      status: "Planned"
    )
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
SELECT "user_schedules"."course_id" FROM "user_schedules" WHERE "user_schedules"."student_id" = ? AND "user_schedules"."status" = ?  [["student_id", 980190962], ["status", "Planned"]]
SELECT "courses".* FROM "courses" WHERE "courses"."class_name" = ? LIMIT ?  [["class_name", "Database Design"], ["LIMIT", 1]]
INSERT INTO "user_schedules" ("student_id", "course_id", "status", "created_at", "updated_at", "term") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["student_id", 980190962], ["course_id", 123458], ["status", "Planned"], ["created_at", "2025-04-07 16:44:28.744775"], ["updated_at", "2025-04-07 16:44:28.744775"], ["term", "Fall 2025"]]

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("CRN", "class_name", "professor", "term", "credits", "class_time", "created_at", "updated_at", "major", "status", "prerequisite", "mon", "tue", "wed", "thu", "fri", "end_time") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "CRN"

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "class_name" = ?, "updated_at" = ? WHERE "courses"."CRN" = ?  [["class_name", "Updated Course"], ["updated_at", "2025-03-25 19:37:16.961085"], ["CRN", 101]]