app/controllers/schedule_view_controller.rb

SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."student_id" = ?  [["student_id", 298486374]]
---
  def index
    @student = Student.find(session[:student_id])  # Find the student from session

    # Get the current term based on the date or user selection
    @term = params[:term] || next_term  # Check if there's a selected term, otherwise use the next_term

    # Filter enrolled courses to only include those for the selected term
    @enrolled_courses = @student.courses.where(term: @term)

    # Only show UserSchedules that match the selected term
    @user_schedules = @student.user_schedules.includes(:course).select { |us| us.course.term == @term }

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
INSERT INTO "user_schedules" ("student_id", "course_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["student_id", 298486374], ["course_id", 102], ["status", nil], ["created_at", "2025-03-25 19:37:17.028125"], ["updated_at", "2025-03-25 19:37:17.028125"]]
---
  def create
    student = Student.find(session[:student_id])
    course = Course.find(params[:course_id])

    UserSchedule.create!(student_id: student.id, course_id: course.id, term: course.term)

SELECT "user_schedules".* FROM "user_schedules" WHERE "user_schedules"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "user_schedules" WHERE "user_schedules"."id" = ?  [["id", 980190962]]
---
  def destroy
    user_schedule = UserSchedule.find(params[:id])
    user_schedule.destroy