app/controllers/sessions_controller.rb

  def create
    # Try to log in as student first
    student = Student.find_by(email: params[:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]