app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("email", "name", "password_digest", "credits_earned", "created_at", "updated_at", "major", "notifications") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    if @student.save

UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Updated Name"], ["updated_at", "2025-03-25 19:37:16.834212"], ["id", 980190962]]
---
  def update
    if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 980190962]]
---
  def destroy
    @student.destroy

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def set_student
    @student = Student.find_by(id: params[:id]) || Student.find_by(id: session[:student_id])